Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
import pandas as pd

In [2]:
df = pd.Series([4,8,15,16,23,42])

In [3]:
df

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [5]:
l = [1,2,3,4,5,6,7,8,9,0]

In [6]:
pd.Series(l)

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
9    0
dtype: int64

Q3. Create a Pandas DataFrame that contains the following data: 

Name
Alice
Bob
Claire

Age
25
30
27

Gender
Female
Male
Female

Then, print the DataFrame.

In [8]:
df = pd.DataFrame({"Name" : ["Alice", "Bob", "Claire"],
                   "Age" : [25, 30, 27],
                   "Gender" : ["Female" , "Male", "Female"]
})

In [9]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

Ans: DataFrame is a two-dimensional tabular data structure, while pandas Series is a one-dimensional labeled array. For example :

Dataframe

In [10]:
df = pd.DataFrame({"Name" : ["Alice", "Bob", "Claire"],
                   "Age" : [25, 30, 27],
                   "Gender" : ["Female" , "Male", "Female"]
})

In [11]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [12]:
#SERIES

pd.Series([4,8,15,16,23,42])

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

Ans : few functions are :

1) head() and tail(): Used to view the first or last few rows of the DataFrame, respectively.

2) info(): Provides a summary of the DataFrame, including data types, non-null values, and memory usage.

3) describe(): Generates descriptive statistics for numerical columns in the DataFrame, such as count, mean, min, max, etc.

4) filter(): Filters rows or columns based on certain conditions.

5) groupby(): Groups data based on a specific column, allowing you to perform aggregate functions on the groups.

Depending on our data analysis requirements, we can use various other functions such as drop(), merge(), pivot_table(), apply(), and more.

In [13]:
df.head(2)

    Name  Age  Gender
0  Alice   25  Female
1    Bob   30    Male

In [14]:
df.tail(1)

     Name  Age  Gender
2  Claire   27  Female

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Ans : Only series is mutable.

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [15]:
names = pd.Series(['Alice', 'Bob', 'Claire', 'David', 'Emma'])
ages = pd.Series([25, 30, 28, 22, 35])
genders = pd.Series(['Female', 'Male', 'Female', 'Male', 'Female'])
data = {'Name': names, 'Age': ages, 'Gender': genders}
df = pd.DataFrame(data)

In [16]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   28  Female
3   David   22    Male
4    Emma   35  Female